# SQL JOINS
SQL Join statement is used to combine data from two or more tables based on a common field between them.

### Types of joins:
1. INNER JOINS
2. LEFT JOINS
3. FULL OUTER JOINS
4. RIGHT JOINS

For this session we'll be using a CIA factbook database.

![ERD](./assets/schema.svg)

In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

#### Structure of a JOIN Statement
```sql
    SELECT Column_list
    FROM TABLE1
    [JOIN TYPE] TABLE2
    ON Table1.ColName = Table2.ColName
```
* **TABLE1** - First table to be joined
* **[JOIN TYPE] TABLE2** - The type of join you are using e.g LEFT JOIN / INNER JOIN
* **ON** - Tells which columns to use to join the tables.

In [2]:
%%sql
SELECT
    name,
    type
FROM sqlite_master
WHERE type IN ("table","view");

 * sqlite:///factbook.db
Done.

[('sqlite_sequence', 'table'), ('facts', 'table'), ('cities', 'table')]

In [5]:
%%sql
SELECT *
FROM cities
LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'Oranjestad', 37000, 1, '216'),
 (2, "Saint John'S", 27000, 1, '6'),
 (3, 'Abu Dhabi', 942000, 1, '184'),
 (4, 'Dubai', 1978000, 0, '184'),
 (5, 'Sharjah', 983000, 0, '184')]

In [6]:
%%sql
SELECT *
FROM facts
LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

## INNER JOIN
* The inner join compares rows in Table1 with Table2 to check if anything matches based on the condition in the ON clause.
* When the join condition is met, SQL returns matched rows in both tables with the selected columns in the SELECT clause.


![INNER JOIN](./assets/inner-join.png)

- Say, we wanted to get cities for each country in the facts table. 
- There is no **City** column in the facts table.
- However, we have a table called **cities** and it has a relationship with the facts table through the facts_id column in cities table and id column in the facts table.
- We can join these two tables and select the cities in each country.

In [8]:
%%sql
SELECT 
    facts.name AS Country,
    cities.name AS City
FROM facts
INNER JOIN cities ON cities.facts_id = facts.id
LIMIT 10;

 * sqlite:///factbook.db
Done.

[('Aruba', 'Oranjestad'),
 ('Antigua and Barbuda', "Saint John'S"),
 ('United Arab Emirates', 'Abu Dhabi'),
 ('United Arab Emirates', 'Dubai'),
 ('United Arab Emirates', 'Sharjah'),
 ('Afghanistan', 'Kabul'),
 ('Algeria', 'Algiers'),
 ('Algeria', 'Oran'),
 ('Azerbaijan', 'Baku'),
 ('Albania', 'Tirana')]

#### Exercise: 
* Use INNER JOIN to get only the Capital cities for each country.
* HINT: In the capital column of the cities table, 1 represents capital city and 0  non-capital city.

## LEFT JOIN
* A LEFT JOIN will include all rows an inner join would select, plus any rows from the first (left) table that don't have a match in the second table.
* We could say that the LEFT JOIN return all rows in the left table and only rows in the right table that meet the condition in the ON clause.
* The result is NULL in the right table if there is no match for in the ON clause condition.
* When using INNER JOINS, you should always be thoughtful of the data you might be dropping in the process.


![Left Join](./assets/left-join.png)

In [16]:
%%sql
SELECT f.name AS country, c.name AS city
FROM facts f
RIGHT JOIN cities c ON c.facts_id = f.id
LIMIT 10;

 * sqlite:///factbook.db
Done.

[('Afghanistan', 'Kabul'),
 ('Albania', 'Tirana'),
 ('Algeria', 'Algiers'),
 ('Algeria', 'Oran'),
 ('Andorra', 'Andorra La Vella'),
 ('Angola', 'Luanda'),
 ('Angola', 'Huambo'),
 ('Antigua and Barbuda', "Saint John'S"),
 ('Argentina', 'Buenos Aires'),
 ('Argentina', 'Cordoba')]

## RIGHT JOIN
* A right join, as the name suggests, is exactly the opposite of a left join.
* While the left join includes all rows in the table before the JOIN clause, the right join includes all rows in the new table in the JOIN clause. 
* The main reason a right join would be used is when you are joining more than two tables, otherwise RIGHT JOINS are rarely used.


![Right Join](./assets/Right%20Join.png)

## FULL OUTER JOIN
* A full outer join will include all rows from the tables on both sides of the join.
* FULL OUTER JOIN is not supported by SQLite


![Full Outer Join](./assets/full-outer-join.png)

## Exercise:
* The music database provided contains data about a fictional music store.
* Here's the schema of the the database
![Music Schema](./assets/music-schema.svg)

### Use this database to answer the following questions.

1. **Write a query that gathers data about the invoice with an invoice_id of 5. Include the following columns**
> * The id of the track, track_id.
> * The name of the track, track_name.
> * The name of media type of the track, track_type.
> * The price that the customer paid for the track, unit_price.

2. **Add a column containing the artists name to the query from the previous question.**
> * The column should be called artist_name.
> * The column should come last in the result table.

# END